emacs.org
#+TITLE: Tung Dao's Emacs configuration
#+AUTHOR: Tung Dao

* Usage

** Obtaining the Source

   You can find the latest version of the configuration in [[https://github.com/tungd/dotfiles][the GitHub
   repository]]. The meat of it (and the source of this document) is the
   =emacs.org= file.

   Big thank to Noah Frederick for his [[https://github.com/noahfrederick/dots][awesome Emacs setup]]. I have stolen
   many of his ideas.

** Installation

   I use =package.el= to manage Emacs packages and their dependencies. [[https://github.com/cask/cask][Cask]]
   is an alternative, however I find it hard to use on Windows, so I went
   with the vanila =packages.el= instead.

   Still, the setup is installable from scratch. Just start Emacs, open
   =~/.emacs.d/packages.el= and evaluate the buffer;

** Commentary

   Any variables, functions, or macros defined in this configuration are
   "namespaced" with a prefix of ~td/~. This is only a convention for easily
   distinguishing between built-in functions and those defined in this
   configuration or another package, and has no other special significance.

** Configuring Packages

   I use [[https://github.com/jwiegley/use-package][use-package]] to autoload packages. It provides a DSL for setting up
   autoloads and keybindings, and for deferring the loading of packages that
   might otherwise slow down Emacs's startup.

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no
     (require 'use-package)
   #+END_SRC

* Emacs Initialization

** Paths

   Keep any Elisp files not installed from a package repository in the
   =vendor/= directory:

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq gc-cons-threshold (* 4 1024 1024))

     (defvar td/vendor-directory (concat user-emacs-directory "vendor/"))
     (add-to-list 'load-path td/vendor-directory)
   #+END_SRC

   Keep theme files in the =themes/= directory:

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq custom-theme-directory (concat user-emacs-directory "themes/"))
   #+END_SRC

   Keep temporary files in a separate directory:

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no
     (defvar td/data-directory (concat user-emacs-directory "data/"))
     (unless (file-exists-p td/data-directory)
       (mkdir td/data-directory))
   #+END_SRC

** Benchmarking

   It's useful to measure how long it takes Emacs to start up, so
   let's show the total time in a message:

   #+NAME: init-after
   #+BEGIN_SRC emacs-lisp :tangle no :tangle no
     (defun td/show-startup-time ()
       "Show Emacs's startup time in the minibuffer"
       (message "Startup time: %s seconds."
                (emacs-uptime "%s")))

     (add-hook 'emacs-startup-hook 'td/show-startup-time 'append)
   #+END_SRC

   [[https://github.com/dholm/benchmark-init-el][benchmark-init.el]] can give us a breakdown of time spent on ~require~
   and ~load~ calls. After Emacs has fully loaded, run the command ~M-x
   benchmark-init/show-durations-tree~ or ~M-x
   benchmark-init/show-durations-tabular~ to get the detailed packages'
   impact on load time.

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no :tangle no
     (require 'benchmark-init)
     (add-hook 'after-init-hook 'benchmark-init/deactivate)
   #+END_SRC

** Platform-specific

   There are a few settings that are only relevant to certain OS:

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq delete-by-moving-to-trash t)

     (when (eq system-type 'gnu/linux)
       (exec-path-from-shell-initialize))

     (when (eq system-type 'darwin)
       (setq ns-use-native-fullscreen nil
             ns-command-modifier 'meta
             ns-option-modifier 'super
             trash-directory "~/.Trash/")

       ;; BSD ls does not support --dired. Use GNU core-utils: brew install coreutils
       (when (executable-find "gls")
         (setq insert-directory-program "gls"))

       ;; Derive PATH by running a shell so that GUI Emacs sessions have access to it
       (exec-path-from-shell-initialize))

     (when (eq system-type 'windows-nt)
       (add-to-list 'exec-path "C:\\MinGW\\msys\\1.0\\bin"))
   #+END_SRC

** Server

   The Emacs server allows for using =emacsclient= to quickly pop open a
   new frame in a terminal. To finish editing a file in =emacsclient=,
   use ~C-x #~.

   #+NAME: init-after
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package server
       :defer 1
       :commands server-running-p
       :config
       (progn
         (unless (server-running-p) (server-start))))
   #+END_SRC

   Here are the most common ways in which =emacsclient= is used:

   | Command                         | Description                     |
   |---------------------------------+---------------------------------|
   | =emacsclient=                     | Edit in existing frame          |
   | =emacsclient -n (--no-wait)=      | Do not wait--return immediately |
   | =emacsclient -c (--create-frame)= | Edit in a new frame             |
   | =emacsclient -t (--tty)=          | Edit in a new terminal frame    |
   | =emacsclient -e (--eval)=         | Evaluate the following Elisp    |

   For more, see =man emacsclient=.

** Temporary Files

   Autosave and backup files (currently disabled) go in =/tmp/=. We
   also prevent Emacs from making "lock files", since they are
   causing problem with build tools such as =gulp=.

   #+NAME: init-after
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq backup-directory-alist
           `((".*" . ,td/data-directory)))
     (setq auto-save-list-file-prefix td/data-directory
           auto-save-timeout (* 5 60))
     (setq create-lockfiles nil)
   #+END_SRC

** Private

   Since this configuration is kept in version control in public view,
   I keep sensitive information (mostly passwords) in a separate file
   encrypted using GnuPG. The file is kept in ~.netrc~ format, so that it can
   be used automagically by Tramp.

   #+NAME: init-after
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq user-full-name "Tung Dao"
           user-mail-address "me@tungdao.com")
   #+END_SRC

** Custom

   Set alternative location for =custom-set-variables= and =custom-set-faces=:

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
     (load custom-file 'noerror)
   #+END_SRC

   Define a custom keymap to be used later on.

   #+NAME: init-before
   #+BEGIN_SRC emacs-lisp :tangle no
     (bind-keys :prefix-map td/custom-map :prefix "C-c b")
   #+END_SRC

** Fix

   In Emacs 24.4, there's a bug that breaks every ~cc-mode~ derived,
   including PHP mode. The bug is related to ~cl~ package being used, but
   not required. I'll just go ahead and require ~cl~. This is going to be
   fixed in Emacs 24.5.

   http://lists.gnu.org/archive/html/bug-gnu-emacs/2014-10/msg01332.html

   #+NAME: init-before
   #+begin_src emacs-lisp :tangle no
     (require 'cl)
   #+end_src

* Appearance

** UI

   Hide parts of the GUI that we don't need, namely the graphical tool
   bar and any scroll bars. Also, adjust some of the markers on the fringe.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq default-frame-alist
           '((left-fringe . 16) (right-fringe . 0)
             (border-width . 0)
             (internal-border-width . 0)
             (left . 256)
             (width . 120) (height . 34)
             (font . "Fira Mono 14")))

     (setq-default cursor-type '(bar . 3))

     ;; Fallback font for missing Unicode glyph
     ;; (set-fontset-font
     ;;  nil '(#x0250 . #x02af) (font-spec :family "DejaVu Sans Mono"))

     (when (fboundp 'tool-bar-mode)
       (tool-bar-mode -1))
     (when (fboundp 'scroll-bar-mode)
       (scroll-bar-mode -1))
     (when (fboundp 'blink-cursor-mode)
       (blink-cursor-mode -1))
     (unless (and (eq system-type 'darwin) (display-graphic-p))
       (when (fboundp 'menu-bar-mode)
         (menu-bar-mode -1)))

     (setcdr
      (assoc 'truncation fringe-indicator-alist) nil)

     (let ((display-table
            (or standard-display-table
                (setq standard-display-table (make-display-table)))))
       (set-display-table-slot display-table 'truncation ?¬)
       (set-display-table-slot display-table 'vertical-border ?\s)
       (set-window-display-table (selected-window) display-table))
   #+END_SRC

   Load the theme, which determines colors and font variants. Solarized is
   a very popular one.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     (load-theme 'adwaita t)
     ;; (load-theme 'custom t)
   #+END_SRC

   Highlight the current line.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     ;; (global-hl-line-mode t)
   #+END_SRC

   Display the line and column number in the mode line.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     (line-number-mode t)
     (column-number-mode t)
   #+END_SRC

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     ;; (if (fboundp 'toggle-frame-maximized)
     ;;     (add-hook 'emacs-startup-hook 'toggle-frame-maximized))
   #+END_SRC

   Suppress the theme's background color and Emacs's menu bar in
   terminal frames:

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     (defun td/after-make-frame (frame)
       (unless (display-graphic-p frame)
         (if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
         (set-face-background 'default "dummy-color" frame)))

     (add-hook 'after-make-frame-functions 'td/after-make-frame)
   #+END_SRC

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq ring-bell-function 'ignore)
     (setq inhibit-startup-screen t)

     ;; Set message for *scratch* buffer
     (setq initial-scratch-message
           (concat ";; Hello, Tung.\n"
                   ";; Kẻ thất bại chỉ có một loại,\n"
                   ";; chính là loại người từ bỏ trước khi đạt tới thành công.\n"))

     ;; Use ANSI color in shell
     (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)

     ;; Never require full word answers
     (defalias 'yes-or-no-p 'y-or-n-p)
   #+END_SRC

** Mode-line

   [[https://github.com/Bruce-Connor/smart-mode-line][Smart Mode Line]] provides a fairly understandable mode-line format.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package smart-mode-line
       :init (sml/setup)
       :config
       (progn
         (add-to-list 'sml/replacer-regexp-list '("^~/Projects/dotfiles/\\(.*\\)/" ":Config:\\1:"))

         (use-package rich-minority
           :init
           (progn
             (add-to-list 'rm-hidden-modes " Undo-Tree")
             (add-to-list 'rm-hidden-modes " yas")
             (add-to-list 'rm-hidden-modes " company")))))
   #+END_SRC

** Highlight

   I switched from ~rainbow-delimiters~ with the ~highlight-parentheses~. My
   impression is that it is better than ~rainbow-delimiters~ in term of
   functionality, however it is also more distracting to see the
   parentheses constantly change their color.

   #+name: appearance
   #+begin_src emacs-lisp :tangle no
     (use-package highlight-parentheses
       :defer 1
       :config (global-highlight-parentheses-mode t))
   #+end_src

   Highlight matching parenthesis, brace, etc.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package paren
       :defer 1
       :init (setq-default show-paren-delay 0)
       :config (show-paren-mode t))
   #+END_SRC

  #+name: appearance
  #+begin_src emacs-lisp :tangle no
    (use-package highlight-escape-sequences
      :defer 1
      :config (hes-mode t))
  #+end_src

