emacs.el

;;; emacs.el --- Emacs configuration generated via Org Babel

;;; Commentary:

;; Do not modify this file by hand.  It was automatically generated
;; from `emacs.org` in the same directory.  See that file for more
;; information.

;;; Code:

;; Configuration group: init-before
(require 'use-package)
(setq gc-cons-threshold (* 4 1024 1024))

(defvar td/vendor-directory (concat user-emacs-directory "vendor/"))
(add-to-list 'load-path td/vendor-directory)
(setq custom-theme-directory (concat user-emacs-directory "themes/"))
(defvar td/data-directory (concat user-emacs-directory "data/"))
(unless (file-exists-p td/data-directory)
  (mkdir td/data-directory))
(require 'benchmark-init)
(add-hook 'after-init-hook 'benchmark-init/deactivate)
(setq delete-by-moving-to-trash t)

(when (eq system-type 'gnu/linux)
  (exec-path-from-shell-initialize))

(when (eq system-type 'darwin)
  (setq ns-use-native-fullscreen nil
        ns-command-modifier 'meta
        ns-option-modifier 'super
        trash-directory "~/.Trash/")

  ;; BSD ls does not support --dired. Use GNU core-utils: brew install coreutils
  (when (executable-find "gls")
    (setq insert-directory-program "gls"))

  ;; Derive PATH by running a shell so that GUI Emacs sessions have access to it
  (exec-path-from-shell-initialize))

(when (eq system-type 'windows-nt)
  (add-to-list 'exec-path "C:\\MinGW\\msys\\1.0\\bin"))
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file 'noerror)
(bind-keys :prefix-map td/custom-map :prefix "C-c b")
(require 'cl)

;; Configuration group: appearance
(setq default-frame-alist
      '((left-fringe . 16) (right-fringe . 0)
        (border-width . 0)
        (internal-border-width . 0)
        (left . 256)
        (width . 120) (height . 34)
        (font . "Fira Mono 14")))

(setq-default cursor-type '(bar . 3))

;; Fallback font for missing Unicode glyph
;; (set-fontset-font
;;  nil '(#x0250 . #x02af) (font-spec :family "DejaVu Sans Mono"))

(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))
(when (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1))
(when (fboundp 'blink-cursor-mode)
  (blink-cursor-mode -1))
(unless (and (eq system-type 'darwin) (display-graphic-p))
  (when (fboundp 'menu-bar-mode)
    (menu-bar-mode -1)))

(setcdr
 (assoc 'truncation fringe-indicator-alist) nil)

(let ((display-table
       (or standard-display-table
           (setq standard-display-table (make-display-table)))))
  (set-display-table-slot display-table 'truncation ?¬)
  (set-display-table-slot display-table 'vertical-border ?\s)
  (set-window-display-table (selected-window) display-table))
(load-theme 'adwaita t)
;; (load-theme 'custom t)
;; (global-hl-line-mode t)
(line-number-mode t)
(column-number-mode t)
;; (if (fboundp 'toggle-frame-maximized)
;;     (add-hook 'emacs-startup-hook 'toggle-frame-maximized))
(defun td/after-make-frame (frame)
  (unless (display-graphic-p frame)
    (if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
    (set-face-background 'default "dummy-color" frame)))

(add-hook 'after-make-frame-functions 'td/after-make-frame)
(setq ring-bell-function 'ignore)
(setq inhibit-startup-screen t)

;; Set message for *scratch* buffer
(setq initial-scratch-message
      (concat ";; Hello, Tung.\n"
              ";; Kẻ thất bại chỉ có một loại,\n"
              ";; chính là loại người từ bỏ trước khi đạt tới thành công.\n"))

;; Use ANSI color in shell
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)

;; Never require full word answers
(defalias 'yes-or-no-p 'y-or-n-p)
(use-package smart-mode-line
  :init (sml/setup)
  :config
  (progn
    (add-to-list 'sml/replacer-regexp-list '("^~/Projects/dotfiles/\\(.*\\)/" ":Config:\\1:"))

    (use-package rich-minority
      :init
      (progn
        (add-to-list 'rm-hidden-modes " Undo-Tree")
        (add-to-list 'rm-hidden-modes " yas")
        (add-to-list 'rm-hidden-modes " company")))))
(use-package highlight-parentheses
  :defer 1
  :config (global-highlight-parentheses-mode t))
(use-package paren
  :defer 1
  :init (setq-default show-paren-delay 0)
  :config (show-paren-mode t))
(use-package highlight-escape-sequences
  :defer 1
  :config (hes-mode t))
