emacs.el
(use-package rainbow-mode
  :commands rainbow-turn-on
  :init
  (add-hook 'prog-mode-hook 'rainbow-turn-on))
;; (use-package hideshow
;;   :init
;;   :defer t
;;   (progn
;;     (require 'hideshowvis)

;;     ;; We need an around advice here to access the ov internal variable
;;     (defadvice display-code-line-counts
;;         (around td/hideshowvis-no-line-count activate)
;;       ad-do-it
;;       (overlay-put ov 'display " ..."))

;;     (hideshowvis-symbols)

;;     (defun td/toggle-hiding-on-demand ()
;;       (interactive)
;;       (unless hs-minor-mode
;;         (hs-minor-mode t))
;;       (hs-toggle-hiding))
;;     (bind-key "C-c C-SPC" 'td/toggle-hiding-on-demand)))
(use-package origami
  :bind (("C-c C-SPC" . origami-toggle-node)))
(use-package popwin
  :commands popwin-mode
  :defer 1
  :config
  (progn
    (bind-key "C-x p" popwin:keymap)

    (mapc (lambda (c)
            (add-to-list 'popwin:special-display-config c))
          '((occur-mode :noselect nil)
            ("*Org Agenda*" :width 60 :position right :dedicated t :stick t)
            ("*Compile-Log*" :height 20 :noselect t)
            ("*Ido Completions*" :noselect t :height 15)
            ("*cider-error*" :height 15 :stick t)
            ("*cider-doc*" :height 15 :stick t)
            ("*cider-src*" :height 15 :stick t)
            ("*cider-result*" :height 15 :stick t)
            ("*cider-macroexpansion*" :height 15 :stick t)
            (shell-mode :height 15)
            (ag-mode :height 15)))

    (popwin-mode 1)))
(use-package diff-hl
  :defer 1
  :config
  (progn
    (define-fringe-bitmap 'td/diff-hl-bmp [192] 1 16 '(top t))
    (defun td/diff-hl-bmp (type pos) 'td/diff-hl-bmp)

    (setq diff-hl-draw-borders nil
          diff-hl-fringe-bmp-function #'td/diff-hl-bmp)

    (set-face-attribute 'diff-hl-insert nil :background nil :foreground "#81af34")
    (set-face-attribute 'diff-hl-delete nil :background nil :foreground "#ff0000")
    (set-face-attribute 'diff-hl-change nil :background nil :foreground "#deae3e")

    ;; (set-face-attribute 'diff-hl-insert nil :background nil)
    ;; (set-face-attribute 'diff-hl-delete nil :background nil)
    ;; (set-face-attribute 'diff-hl-change nil :background nil)

    (defun diff-hl-overlay-modified (ov after-p beg end &optional len)
      "Markers disappear and reapear is kind of annoying to me.")

    (global-diff-hl-mode t)))
(use-package fullframe
  :config
  (progn
    (fullframe ibuffer ibuffer-quit)

    (defvar td/last-window-configuration nil
      "Last window configuration.")

    ;; Ediff has multiple frames, and does not play nice with fullframe API
    (defun td/store-window-configuration ()
      "Store current window configuration."
      (setq td/last-window-configuration (current-window-configuration)))

    (defun td/restore-window-configuration ()
      "Restore current window configuration."
      (set-window-configuration td/last-window-configuration)))

    (add-hook 'ediff-before-setup-hook #'td/store-window-configuration)
    (add-hook 'ediff-quit-hook #'td/restore-window-configuration 'append)
    (add-hook 'ediff-suspend-hook #'td/restore-window-configuration 'append))

;; Configuration group: editing
(setq default-input-method 'vietnamese-telex)
(set-default-coding-systems 'utf-8-unix)
(set-terminal-coding-system 'utf-8-unix)
(set-keyboard-coding-system 'utf-8-unix)
(prefer-coding-system 'utf-8-unix)
(defadvice ansi-term (after advise-ansi-term-coding-system)
  (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
(ad-activate 'ansi-term)
(use-package undo-tree
  :init (global-undo-tree-mode t)
  :config
  (setq undo-tree-visualizer-timestamps t
        undo-tree-visualizer-relative-timestamps t
        undo-tree-history-directory-alist
        (list (cons "." (expand-file-name "undos" td/data-directory)))))
(use-package vc-hooks
  :defer t
  :config (setq vc-follow-symlinks t))

(use-package vc-dir
  :defer t
  :config
  (progn
    (defun td/vc-git-command (verb fn)
      (let* ((args (vc-deduce-fileset nil t))
             (backend (car args))
             (files (nth 1 args)))
        (if (eq backend 'Git)
            (progn
              (funcall fn files)
              (message (concat verb " "
                               (number-to-string (length files))
                               " file(s).")))
          (message "Not in a vc git buffer."))))

    (defun td/vc-git-add (&optional revision args comment)
      (interactive "P")
      (td/vc-git-command "Staged" 'vc-git-register))

    (defun td/vc-git-reset (&optional revision args comment)
      (interactive "P")
      (td/vc-git-command
       "Unstaged"
       (lambda (files) (vc-git-command nil 0 files "reset" "-q" "--"))))

    (defun td/vc-git-amend (&optional revision args comment)
      (interactive "P")
      (td/vc-git-command
       "Ammended"
       (lambda (files)
         (vc-git-command nil 0 files
                         "commit" "--amend" "--reuse-message=HEAD"))))

    (defadvice vc-dir-refresh
        (after td/vc-hide-up-to-date-after-refresh activate)
      (vc-dir-hide-up-to-date))

    (bind-keys :map vc-dir-mode-map
               ("r" . vc-revert-buffer)
               ("a" . td/vc-git-add)
               ("u" . td/vc-git-reset)
               ("A" . td/vc-git-amend))

    (bind-keys :map vc-prefix-map
               ("r" . vc-revert-buffer)
               ("a" . td/vc-git-add)
               ("u" . td/vc-git-reset))))
