emacs.org
** Search and Replace

   #+name: editing
   #+begin_src emacs-lisp :tangle no
     (use-package isearch
       :bind (("C-s" . isearch-forward-regexp)
              ("C-r" . isearch-backward-regexp))
       :init
       (progn
         (defun td/isearch-message (&optional c-q-hack ellipsis)
           "Cursor flashing in the echo area makes me crazy."
           (isearch-message c-q-hack nil))

         (setq lazy-highlight-initial-delay 0
               isearch-message-function #'td/isearch-message)

         ;;(require 'isearch-diacritics-fold)
         ))
   #+end_src

   =Anzu= is better than the default =query-replace= commands for a
   number of reasons:
   - Show the current position over total matches.
   - Display search/replace preview (similar to Evil).

   | Binding | Command                                        |
   |---------+------------------------------------------------|
   | =M-%=     | Search/replace with Anzu                       |
   | =C-c r=   | Replace word under cusor inside current 'defun |
   | =C-c R=   | Replace word under cursor over the buffer      |

   #+name: editing
   #+begin_src emacs-lisp :tangle no
     (use-package anzu
       :init (global-anzu-mode t)
       :bind (("M-%" . anzu-query-replace-regexp)
              ("C-c r" . anzu-query-replace-at-cursor-thing)
              ("C-c R" . td/anzu-query-replace-all-at-cursor))
       :config
       (progn
        (setq anzu-mode-lighter ""
              anzu-search-threshold 256
              anzu-minimum-input-length 3)

        (defun td/anzu-query-replace-all-at-cursor ()
          (interactive)
          (let ((anzu-replace-at-cursor-thing 'page))
            (call-interactively 'anzu-query-replace-at-cursor-thing)))))
   #+end_src

** Whitespace and Formatting

   #+NAME: editing
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq-default indent-tabs-mode nil)
   #+END_SRC

   #+NAME: editing
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq require-final-newline t) ; auto-insert final newlines in all files

     (use-package whitespace
       :commands (whitespace-cleanup
                  whitespace-mode)
       :bind ("C-c w" . whitespace-mode)
       :config
       (progn
         (add-to-list 'whitespace-display-mappings
                      '(newline-mark ?\n [?\u00AC ?\n] [?$ ?\n]) t)

         (setq whitespace-line-column nil
               whitespace-style
               '(face
                 tabs tab-mark
                 spaces space-mark
                 newline newline-mark
                 trailing lines-tail
                 space-before-tab space-after-tab))

         (add-hook 'before-save-hook #'whitespace-cleanup)
         (add-hook 'before-save-hook #'delete-trailing-whitespace)))
   #+END_SRC

   Auto-filling refers to hard-wrapping text. The default fill-column
   is 80. We adjust this value for specific modes as needed.

   #+NAME: editing
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq-default
      comment-auto-fill-only-comments t
      fill-column 75)

     (add-hook 'text-mode-hook 'turn-on-auto-fill)
     (add-hook 'prog-mode-hook 'turn-on-auto-fill)
   #+END_SRC

** Spell checking

   Use aspell for spell checking. Installation:

   | Platform  | Command                |
   |-----------+------------------------|
   | Mac OS X  | =brew install aspell=    |
   | Archlinux | =sudo pacman - S aspell= |

   #+NAME: editing
   #+BEGIN_SRC emacs-lisp :tangle no
     (when (executable-find "aspell")
       (use-package ispell
         :bind ("<f8>" . ispell-word)
         :init (setq-default ispell-program-name "aspell"
                             ispell-extra-args '("--sug-mode=ultra" "--lang=en_US")
                             ispell-skip-html t
                             ispell-silently-savep t
                             ispell-really-aspell t))

       (use-package flyspell
         :defer t
         :init (add-hook 'text-mode-hook 'flyspell-mode)
         :config
         (progn
           (require 'flyspell-ignore-faces)
           (put 'org-mode 'flyspell-mode-predicate 'td/flyspell-check-p))))
   #+END_SRC

** Parentheses

   I'm deciding between the built-in ~electric-pair-mode~ and
   ~smartparens~. ~electric-pair-mode~ has better behavior in many cases,
   for example skipping closing pairs, and inserting pairs inside
   strings. It also feels much more lighter. However, ~smartparens~ do
   have its own strength, as it is more flexible, and structural
   editing by manipulating ~s-expression~ is very interesting. The
   current point ratio goes like 6/4 favoring ~smartparens~.

   | Binding         | Function                                                   |
   |-----------------+------------------------------------------------------------|
   | =C-M-k=           | Kill                                                       |
   | =C-M-w=           | Copy                                                       |
   | =M-D=             | Unwrap                                                     |
   | =C-M-t=           | Transpose, very useful switch order of function arguments  |
   | =C-M-<backspace>= | Unwrap and kill things inside that last s-expression       |
   | =C-M-]=           | s-expression oriented ~expand-region~                        |
   | =C-<right>=       | Extend the current s-expression to include next item       |
   | =C-<left>=        | Shrink the current s-expression, giving out the last item  |

   #+name: editing
   #+begin_src emacs-lisp :tangle no
     (use-package smartparens
       :defer t
       :init (smartparens-global-mode t)
       :config
       (progn
         (require 'smartparens-config)
         (sp-use-smartparens-bindings)

         (setq sp-autoinsert-if-followed-by-same 1
               sp-autoescape-string-quote nil
               sp-highlight-pair-overlay nil)

         (sp-pair "{" nil
                  :post-handlers '(:add ("||\n[i]" "RET") ("| " "SPC")))
         (sp-pair "[" nil
                  :post-handlers '(:add ("||\n[i]" "RET") ("| " "SPC")))
         (sp-pair "(" nil
                  :post-handlers '(:add ("||\n[i]" "RET") ("| " "SPC")))

         (defun sp-web-mode-is-code-context (id action context)
           (and (eq action 'insert)
                (or (get-text-property (point) 'part-side)
                    (get-text-property (point) 'block-side))))

         (sp-local-pair 'web-mode "<" nil :when '(sp-web-mode-is-code-context))))
   #+end_src

** Commenting

   #+name: editing
   #+begin_src emacs-lisp :tangle no
     (use-package comment-dwim2
       :commands comment-dwim2
       :init
       (progn
         (setq comment-style 'multi-line)
         (bind-key "C-l" #'comment-dwim-2)))
   #+end_src

** Selecting (Marking)

   For easier marking, I use =expand-region=. To interact with those marks, I
   use =multiple-cursor=.

   #+name: editing
   #+begin_src emacs-lisp :tangle no
     (pending-delete-mode t)

     (setq kill-ring-max 4096
           kill-whole-line t)

     (use-package expand-region
       :bind ("M--" . er/expand-region))

     (use-package multiple-cursors
       :commands (mc/mark-previous-like-this
                  mc/mark-next-like-this
                  mc/skip-to-previous-like-this
                  mc/skip-to-next-like-this
                  mc/mark-all-like-this)
       :init
       (bind-keys ("M-C-9" . mc/mark-previous-like-this)
                  ("M-C-0" . mc/mark-next-like-this)
                  ("M-(" . mc/skip-to-previous-like-this)
                  ("M-)" . mc/skip-to-next-like-this)
                  ("M-C-a" . mc/mark-all-like-this)))

     (bind-key "C-x SPC" 'set-rectangular-region-anchor)
   #+end_src

