emacs.el
(use-package isearch
  :bind (("C-s" . isearch-forward-regexp)
         ("C-r" . isearch-backward-regexp))
  :init
  (progn
    (defun td/isearch-message (&optional c-q-hack ellipsis)
      "Cursor flashing in the echo area makes me crazy."
      (isearch-message c-q-hack nil))

    (setq lazy-highlight-initial-delay 0
          isearch-message-function #'td/isearch-message)

    ;;(require 'isearch-diacritics-fold)
    ))
(use-package anzu
  :init (global-anzu-mode t)
  :bind (("M-%" . anzu-query-replace-regexp)
         ("C-c r" . anzu-query-replace-at-cursor-thing)
         ("C-c R" . td/anzu-query-replace-all-at-cursor))
  :config
  (progn
   (setq anzu-mode-lighter ""
         anzu-search-threshold 256
         anzu-minimum-input-length 3)

   (defun td/anzu-query-replace-all-at-cursor ()
     (interactive)
     (let ((anzu-replace-at-cursor-thing 'page))
       (call-interactively 'anzu-query-replace-at-cursor-thing)))))
(setq-default indent-tabs-mode nil)
(setq require-final-newline t) ; auto-insert final newlines in all files

(use-package whitespace
  :commands (whitespace-cleanup
             whitespace-mode)
  :bind ("C-c w" . whitespace-mode)
  :config
  (progn
    (add-to-list 'whitespace-display-mappings
                 '(newline-mark ?\n [?\u00AC ?\n] [?$ ?\n]) t)

    (setq whitespace-line-column nil
          whitespace-style
          '(face
            tabs tab-mark
            spaces space-mark
            newline newline-mark
            trailing lines-tail
            space-before-tab space-after-tab))

    (add-hook 'before-save-hook #'whitespace-cleanup)
    (add-hook 'before-save-hook #'delete-trailing-whitespace)))
(setq-default
 comment-auto-fill-only-comments t
 fill-column 75)

(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'prog-mode-hook 'turn-on-auto-fill)
(when (executable-find "aspell")
  (use-package ispell
    :bind ("<f8>" . ispell-word)
    :init (setq-default ispell-program-name "aspell"
                        ispell-extra-args '("--sug-mode=ultra" "--lang=en_US")
                        ispell-skip-html t
                        ispell-silently-savep t
                        ispell-really-aspell t))

  (use-package flyspell
    :defer t
    :init (add-hook 'text-mode-hook 'flyspell-mode)
    :config
    (progn
      (require 'flyspell-ignore-faces)
      (put 'org-mode 'flyspell-mode-predicate 'td/flyspell-check-p))))
(use-package smartparens
  :defer t
  :init (smartparens-global-mode t)
  :config
  (progn
    (require 'smartparens-config)
    (sp-use-smartparens-bindings)

    (setq sp-autoinsert-if-followed-by-same 1
          sp-autoescape-string-quote nil
          sp-highlight-pair-overlay nil)

    (sp-pair "{" nil
             :post-handlers '(:add ("||\n[i]" "RET") ("| " "SPC")))
    (sp-pair "[" nil
             :post-handlers '(:add ("||\n[i]" "RET") ("| " "SPC")))
    (sp-pair "(" nil
             :post-handlers '(:add ("||\n[i]" "RET") ("| " "SPC")))

    (defun sp-web-mode-is-code-context (id action context)
      (and (eq action 'insert)
           (or (get-text-property (point) 'part-side)
               (get-text-property (point) 'block-side))))

    (sp-local-pair 'web-mode "<" nil :when '(sp-web-mode-is-code-context))))
(use-package comment-dwim2
  :commands comment-dwim2
  :init
  (progn
    (setq comment-style 'multi-line)
    (bind-key "C-l" #'comment-dwim-2)))
(pending-delete-mode t)

(setq kill-ring-max 4096
      kill-whole-line t)

(use-package expand-region
  :bind ("M--" . er/expand-region))

(use-package multiple-cursors
  :commands (mc/mark-previous-like-this
             mc/mark-next-like-this
             mc/skip-to-previous-like-this
             mc/skip-to-next-like-this
             mc/mark-all-like-this)
  :init
  (bind-keys ("M-C-9" . mc/mark-previous-like-this)
             ("M-C-0" . mc/mark-next-like-this)
             ("M-(" . mc/skip-to-previous-like-this)
             ("M-)" . mc/skip-to-next-like-this)
             ("M-C-a" . mc/mark-all-like-this)))

(bind-key "C-x SPC" 'set-rectangular-region-anchor)
