emacs.el
(bind-key "M-`" #'other-frame)
;; (td/bind "C-M-f" #'td/toggle-fullscreen)

(defun end-with-newline ()
  (interactive)
  (move-end-of-line 1)
  (newline-and-indent))

(defun end-with-semicolon ()
  (interactive)
  (move-end-of-line 1)
  (insert ";"))

(bind-key "RET" #'newline-and-indent)
(bind-key "M-RET" #'end-with-newline)
(bind-key "M-;" #'end-with-semicolon)


(defun td/next-ten-visual-lines ()
  (interactive)
  (next-line 10))

(defun td/previous-ten-visual-lines ()
  (interactive)
  (previous-line 10))

(bind-key "M-n" #'td/next-ten-visual-lines)
(bind-key "M-p" #'td/previous-ten-visual-lines)


(autoload 'zap-up-to-char "misc" nil :interactive)
(autoload 'zap-to-char "misc" nil :interactive)

(bind-key "M-z" #'zap-up-to-char)
(bind-key "M-Z" #'zap-to-char)


(defun td/cleanup-buffer ()
  (interactive)
  (indent-region (point-min) (point-max))
  (untabify (point-min) (point-max))
  (whitespace-cleanup))

(bind-key "M-=" #'td/cleanup-buffer)


(defun td/join-next-line ()
  (interactive)
  (join-line -1))

(bind-key "M-J" #'td/join-next-line)


(defun td/kill-region-or-word ()
  (interactive)
  (call-interactively
   (if (region-active-p) 'kill-region 'backward-kill-word)))

(bind-key "C-w" #'td/kill-region-or-word)


(defun td/eval-and-replace ()
  (interactive)
  (backward-kill-sexp)
  (condition-case nil
      (prin1 (eval (read (current-kill 0)))
             (current-buffer))
    (error (message "Invalid expression")
           (insert (current-kill 0)))))

(bind-key "C-c C-e" #'td/eval-and-replace)


(defun extract-variable (begin end var)
  (interactive "r\nsVariable name: ")
  (kill-region begin end)
  (insert var)
  (forward-line -1)
  (newline-and-indent)
  (insert var " = ")
  (yank))

(defun inline-variable ()
  (interactive)
  (let ((var (current-word)))
    (re-search-forward "= ")
    (let ((value (buffer-substring (point) (point-at-eol))))
      (kill-whole-line)
      (search-forward var)
      (replace-match value))))

(defun align=: (&optional args)
  "Align region to equal signs or colon"
  (interactive)
  (with-region-or-current-line
   (align-regexp (region-beginning) (region-end) "\\(\\s-*\\)[=|:]" 1 1)))


(defun open-thing-at-point ()
  (interactive)
  (cond
   ((-when-let (url (thing-at-point 'url))
      (browse-url url)))
   ((-when-let (email (thing-at-point 'email))
      (browse-url (format "mailto:%s" email))))
   ((-when-let (path (thing-at-point 'filename))
      (if (file-exists-p path)
          (find-file path)
        (if (file-exists-p (concat path ".el"))
            (find-file (concat path ".el"))
          (when (y-or-n-p (format "Create %s?" path))
            (find-file path))))))))

(bind-key "M-o" 'open-thing-at-point)

(defun char-upcasep (letter)
  (eq letter (upcase letter)))

;; TOOD: find appropriate key binding for these functions

(defun capitalize-word-toggle ()
  (interactive)
  (let ((start (car (save-excursion
                      (backward-word)
                      (bounds-of-thing-at-point 'symbol)))))
    (if start
        (save-excursion
          (goto-char start)
          (funcall (if (char-upcasep (char-after))
                       'downcase-region
                     'upcase-region)
                   start (1+ start)))
      (capitalize-word -1))))

(defun upcase-word-toggle ()
  (interactive)
  (let ((bounds (bounds-of-thing-at-point 'symbol))
        beg end
        (regionp (if (eq this-command last-command)
                     (get this-command 'regionp)
                   (put this-command 'regionp nil))))
    (cond
     ((or (region-active-p) regionp)
      (setq beg (region-beginning)
            end (region-end))
      (put this-command 'regionp t))
     (bounds
      (setq beg (car bounds)
            end (cdr bounds)))
     (t
      (setq beg (point)
            end (1+ beg))))
    (save-excursion
      (goto-char (1- beg))
      (and (re-search-forward "[A-Za-z]" end t)
           (funcall (if (char-upcasep (char-before))
                        'downcase-region
                      'upcase-region)
                    beg end)))))


(defun find-file-sudo (&optional arg)
  (interactive)
  (unless (and buffer-file-name
               (file-writable-p buffer-file-name))
    (find-alternate-file
     (concat "/sudo:root@localhost:" buffer-file-name))))


(defun td/before-save-make-directories ()
  (let ((dir (file-name-directory buffer-file-name)))
    (when (and buffer-file-name (not (file-exists-p dir)))
      (make-directory dir t))))

(add-hook 'before-save-hook #'td/before-save-make-directories)


(defun td/after-save-auto-chmod ()
  (when (and (> (length (buffer-string)) 5)
             (string-equal "#!" (buffer-substring-no-properties 1 4)))
    (shell-command
     (format "chmod u+x %s"
             (shell-quote-argument (buffer-file-name))))))

(add-hook 'after-save-hook #'td/after-save-auto-chmod)
(defun delete-current-buffer-file ()
  (interactive)
  (let ((filename (buffer-file-name)))
    (when (and filename (file-exists-p filename))
      (delete-file filename)
      (kill-this-buffer))))

(defun rename-current-buffer-file (new-name)
  (interactive
   (list (read-string "New name: " (buffer-name))))
  (let ((filename (buffer-file-name)))
    (when (and filename (file-exists-p filename))
      (if (get-buffer new-name)
          (error "Buffer named '%s' already exists!" new-name)
        (progn
          (rename-file filename new-name t)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil))))))

(defun write-file-copy (filename)
  (interactive "F")
  (save-restriction (widen)
                    (write-region (point-min) (point-max) filename)))

(defun write-timestamped-file-copy (filename)
  (interactive "F")
  (let ((timestamp (format-time-string "%Y%m%d-%H%M%S"))
        (filename-head (file-name-sans-extension filename))
        (filename-ext (file-name-extension filename t)))
    (write-file-copy (expand-file-name (concat filename-head "_" timestamp filename-ext)))))

(defun write-timestamped-current-file-copy ()
  (interactive)
  (write-timestamped-file-copy (buffer-file-name)))

(bind-keys :map td/custom-map
           ("r" . rename-current-buffer-file)
           ("d" . delete-current-buffer-file)
           ("t" . write-timestamped-current-file-copy))
(use-package yasnippet
  :commands yas-global-mode
  :init
  (progn
    (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
    (yas-global-mode t))
  :config
  (progn
    (setq yas-prompt-functions
          '(yas-ido-prompt yas-completing-prompt yas-no-prompt)
          ;; Suppress excessive log messages
          yas-verbosity 1
          ;; I am a weird user, I use SPACE to expand my
          ;; snippets, this save me from triggering them accidentally.
          yas-expand-only-for-last-commands
          '(self-insert-command org-self-insert-command))

    (unbind-key "TAB" yas-minor-mode-map)
    (unbind-key "<tab>" yas-minor-mode-map)
    (bind-key "SPC" 'yas-expand yas-minor-mode-map)))
