emacs.org
** Diff

   #+NAME: editing
   #+begin_src emacs-lisp :tangle no
     (use-package ediff
       :defer t
       :init
       (progn
         (defun td/ediff-from-command-line (switch)
           (let ((file-a (pop command-line-args-left))
                 (file-b (pop command-line-args-left)))
             (ediff file-a file-b)))

         (add-to-list 'command-switch-alist '("diff" . td/ediff-from-command-line)))
       :config
       (progn
         (setq ediff-window-setup-function 'ediff-setup-windows-plain
               ediff-split-window-function 'split-window-horizontally)))
   #+end_src

* Navigation and Completion

  #+name: navigation-completion
  #+begin_src emacs-lisp :tangle no
    (use-package which-func
      :defer 1
      :config
      (which-function-mode t))

    (use-package imenu
      :defer t
      :bind ("C-c i" . imenu)
      :config
      (setq imenu-auto-rescan t))
  #+end_src

** Auto Complete

   Take a look at ~company-sort-by-backend-importance~.

   #+name: navigation-completion
   #+begin_src emacs-lisp :tangle no
     (use-package company
       :init
       (progn
         (setq company-backends
               '(company-anaconda
                 company-css
                 (;company-yasnippet
                  company-capf
                  company-dabbrev-code
                  company-keywords)))
         (global-company-mode t))
       :config
       (progn
         (use-package company-lines
           :commands (company-lines))

         (setq completion-cycle-threshold 5)

         (setq company-idle-delay 0.2
               company-auto-complete nil
               company-selection-wrap-around t
               company-echo-delay 0
               company-tooltip-align-annotations t
               company-show-numbers t
               company-minimum-prefix-length 3

               company-auto-complete-chars
               '(?\ ?\( ?\) ?. ?\" ?$ ?\' ?< ?> ?| ?!)

               company-transformers
               '(company-sort-by-occurrence)

               company-frontends
               '(company-pseudo-tooltip-unless-just-one-frontend
                 company-echo-metadata-frontend
                 company-preview-if-just-one-frontend))

         (bind-keys :prefix-map td/completion-map
                    :prefix "M-;"
                    ("s" . company-ispell)
                    ("f" . company-files)
                    ("l" . company-lines))

         (bind-keys :map company-active-map
                    ([escape] . company-abort)
                    ("<tab>" . company-complete-dwim)
                    ("<backtab>" . company-select-previous)
                    ("C-n" . company-select-next)
                    ("C-p" . company-select-previous)
                    ("C-s" . company-filter-candidates)
                    ("C-l" . company-show-location)
                    ("C-j" . company-complete-common)
                    ("C-d" . company-show-doc-buffer))

         (defun company-complete-dwim (&optional arg)
           (interactive "P")
           (let ((pos (point)))
             (indent-according-to-mode)
             (when (and (= pos (point)) (looking-at "\\_>"))
               (if (eq last-command 'company-complete-dwim)
                   (company-select-next)
                 (company-complete-common)))))

         (bind-keys :map company-mode-map
                    ([remap indent-for-tab-command] . company-complete-dwim))))
   #+end_src

** Minibuffer

   #+name: navigation-completion
   #+begin_src emacs-lisp :tangle no
     (use-package savehist
       :defer t
       :init
       (progn
         (setq savehist-file (expand-file-name "savehist" td/data-directory))
         (savehist-mode t)))
   #+end_src

   #+name: navigation-completion
   #+begin_src emacs-lisp :tangle no
     (use-package ido
       :commands (ido-switch-buffer
                  ido-find-file)
       :init
       (progn
         (ido-mode t)
         (ido-everywhere t)
         (ido-ubiquitous-mode t)
         (ido-vertical-mode)
         (flx-ido-mode t))

       :config
       (progn
         (setq ido-save-directory-list-file
               (expand-file-name "ido.last" td/data-directory)
               ido-enable-flex-matching t
               ido-create-new-buffer 'always
               ido-case-fold t
               ido-file-extensions-order
               '(".rb" ".py" ".clj" ".cljs" ".el" ".coffee" ".js" ".ts"
                 ".scss" ".php" ".html" t)
               ido-default-buffer-method 'samewindow
               ido-vertical-define-keys nil
               flx-ido-threshold 2048)

         (add-to-list 'ido-ignore-files "\\.DS_Store")
         (add-to-list 'ido-ignore-files "__pycache__")

         (defun td/minibuffer-home ()
           (interactive)
           (if (looking-back "/")
               (insert "~/")
             (call-interactively 'self-insert-command)))

         (defun td/minibuffer-insert-word-at-point ()
           (interactive)
           (let (word beg)
             (with-current-buffer (window-buffer (minibuffer-selected-window))
               (setq word (thing-at-point 'word)))
             (insert word)))

         (defun ido-goto-line ()
           (interactive)
           (let* ((lines (split-string (buffer-string) "[\n\r]"))
                  (choices (-remove (lambda (l) (zerop (length l))) lines))
                  (line (ido-completing-read "Line: " choices)))
             (push-mark)
             (goto-line (+ 1 (-elem-index line lines)))))

         (bind-key "C-c l" #'ido-goto-line)

         (defun td/ido-hook ()
           (bind-keys :map ido-completion-map
                      ("C-h" . delete-backward-char)
                      ("ESC" . ido-exit-minibuffer)
                      ("C-w" . ido-delete-backward-updir)
                      ("C-n" . ido-next-match)
                      ("C-p" . ido-prev-match)
                      ("TAB" . ido-complete)
                      ("C-l" . td/minibuffer-insert-word-at-point)
                      ("~" . td/minibuffer-home)))

         (add-hook 'ido-setup-hook #'td/ido-hook)))
   #+end_src

   Smex provides Ido completion for =M-x=.

   #+NAME: navigation-completion
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package smex
       :bind (("M-m" . smex)
              ("M-M" . smex-major-mode-commands))
       :init
       (progn
         (setq smex-save-file (expand-file-name "smex-items" td/data-directory)
               smex-flex-matching t)
         (smex-initialize)))
   #+END_SRC

** Save Place

   Place the point where we left it when last visiting the same file.

   #+NAME: navigation-completion
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package saveplace
       :init
       (progn
         (setq-default save-place t)))
   #+END_SRC

** Windows

   #+name: navigation-completion
   #+begin_src emacs-lisp :tangle no
     (use-package window-numbering
       :init (window-numbering-mode t)
       :config
       (progn
         (defadvice window-numbering-get-number-string
           (after td/custom-window-numbering-mode-line-string activate)
           (setq ad-return-value (format "[%s] " ad-return-value)))))

     (defun kill-buffer-and-window-silently ()
       (interactive)
       (ignore-errors (kill-buffer-and-window)))

     (bind-keys ("C-c q" . delete-frame)
                ("C-c Q" . delete-window)
                ("C-c k" . kill-buffer-and-window-silently))
   #+end_src

