emacs.el
(setq confirm-nonexistent-file-or-buffer nil)

(use-package uniquify
  :config
  (setq uniquify-buffer-name-style 'post-forward
        uniquify-separator " - "
        uniquify-after-kill-buffer-p t
        uniquify-ignore-buffers-re "^\\*"))

(use-package ibuffer
  :commands ibuffer
  :bind ("C-x C-b" . ibuffer)
  :init
  (progn
    (setq ibuffer-saved-filter-groups
          '(("Config" (or
                       (filename . ".dots/")
                       (filename . ".emacs.d/")))
            ("Shell"  (or
                       (mode . eshell-mode)
                       (mode . shell-mode)))
            ("Dired"  (mode . dired-mode))
            ("Prose"  (or
                       (mode . tex-mode)
                       (mode . plain-tex-mode)
                       (mode . latex-mode)
                       (mode . rst-mode)
                       (mode . markdown-mode)))
            ("Org"    (mode . org-mode))
            ("Gnus"   (or
                       (mode . message-mode)
                       (mode . gnus-group-mode)
                       (mode . gnus-summary-mode)
                       (mode . gnus-article-mode)))
            ("Emacs"  (name . "^\\*.*\\*$")))
          ibuffer-show-empty-filter-groups nil
          ibuffer-expert t)

    (use-package ibuffer-vc
      :commands ibuffer-vc-generate-filter-groups-by-vc-root
      :config
      (progn
        (defun td/ibuffer-apply-filter-groups ()
          "Combine my saved ibuffer filter groups with those generated
     by `ibuffer-vc-generate-filter-groups-by-vc-root'"
          (interactive)
          (setq ibuffer-filter-groups
                (append (ibuffer-vc-generate-filter-groups-by-vc-root)
                        ibuffer-saved-filter-groups))
          (message "ibuffer-vc: groups set")
          (let ((ibuf (get-buffer "*Ibuffer*")))
            (when ibuf
              (with-current-buffer ibuf
                (pop-to-buffer ibuf)
                (ibuffer-update nil t)))))

        (add-hook 'ibuffer-hook 'td/ibuffer-apply-filter-groups)))))
;; (use-package midnight)
(defun td/recent-buffer ()
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

(bind-keys :map td/custom-map
           ("b" . td/recent-buffer))
(use-package ace-jump-mode
  :bind (("M-'" . ace-jump-word-mode)
         ("M-C-'" . ace-jump-char-mode)))
(use-package projectile
  :defer t
  :init (projectile-global-mode t)
  :config
  (progn
    (setq projectile-enable-idle-timer t
          ;; Use static mode line here to eliminate GC. SML already
          ;; displays the current project anyway.
          projectile-mode-line " Proj")

    (bind-keys ("M-l" . projectile-find-file)
               ([remap projectile-ack] . projectile-ag)
               ([remap projectile-grep] . projectile-ag))

    (add-to-list 'projectile-globally-ignored-directories "__pycache__")))

(use-package wgrep
  :defer t
  :init (add-hook 'ag-mode-hook #'wgrep-setup))
(defun td/custom-font-lock-hightlights ()
  (font-lock-add-keywords
   nil '(("\\<\\(FIX\\(ME\\)?\\|TODO\\|HACK\\|REFACTOR\\):"
          1 font-lock-warning-face t)))
  (font-lock-add-keywords
   nil '(("%\\(?:[-+0-9\\$.]+\\)?[bdiuoxXDOUfeEgGcCsSpn]"
          0 font-lock-preprocessor-face t))))

(add-hook 'prog-mode-hook #'td/custom-font-lock-hightlights)

(defun td/occur-todos ()
  (interactive)
  (occur "TODO"))
(setq tags-revert-without-query t)

;; Configuration group: programming
(use-package indent-guide
  :commands (indent-guide-mode)
  :init
  (add-hook 'python-mode-hook #'indent-guide-mode))

(use-package electric-case
  :init
  (progn

    (setq electric-case-convert-calls t)

    (defun td/electric-case-js-init ()
      "TODO: documentation."
      )

    (defun td/electric-case-python-init ()
      "TODO: documentation."
      )

    (add-hook 'java-mode-hook #'electric-case-java-init)
    ;; (add-hook 'js2-mode-hook #'electric-case-java-init)
    ;; (add-hook 'js-mode-hook #'electric-case-java-init)
    (add-hook 'python-mode-hook #'td/electric-case-python-init)))
(use-package compile
  :defer t
  :init
  (progn
    (defun recompile-with-last-configuration ()
      (interactive)
      (save-some-buffers)
      (when compilation-last-buffer
        (with-current-buffer compilation-last-buffer
          (call-interactively 'recompile))))

    (bind-key "C-c m" 'recompile-with-last-configuration))
  :config
  (progn
    (setq compilation-scroll-output t)

    (defun td/colorize-compilation-buffer ()
      (toggle-read-only)
      (ansi-color-apply-on-region (point-min) (point-max))
      (toggle-read-only))

    (add-hook 'compilation-filter-hook #'td/colorize-compilation-buffer)))
(use-package emacs-lisp-mode
  :mode ("Cask" . emacs-lisp-mode))

(use-package eldoc
  :commands turn-on-eldoc-mode
  :init (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
  :config
  (progn
    (defun eldoc-message-now ()
      (interactive))

    (setq eldoc-idle-delay 0)

    (defun eldoc--message-command-p (command)
      (eq command 'eldoc-message-now))

    (bind-key "C-c d" #'eldoc-message-now)

    (eldoc-add-command 'eldoc-message-now)))
(use-package ruby-mode
  :mode (("\\.rake$" . ruby-mode)
         ("\\.gemspec$" . ruby-mode)
         ("\\.ru$" . ruby-mode)
         ("Rakefile$" . ruby-mode)
         ("Gemfile$" . ruby-mode)
         ("Capfile$" . ruby-mode)
         ("Puppetfile$" . ruby-mode)
         ("Guardfile$" . ruby-mode)
         ("Vagrantfile$" . ruby-mode)))
(use-package js
  :defer t
  :config
  (setq js-indent-level 2
        js-expr-indent-offset 2
        js-flat-functions t))

(use-package js2-mode
  :mode "\\.js$"
  :config
  (progn
    (require 'js-indentation)

    (setq-default
     js2-basic-offset 2
     js2-highlight-level 3
     js2-idle-timer-delay 0
     js2-mode-show-parse-errors nil
     js2-strict-missing-semi-warning nil
     js2-indent-switch-body t
     js2-bounce-indent-p nil
     js2-include-node-externs t
     js2-global-externs
     '("jQuery" "Zepto" "$" "location" "Image" "describe" "it" "goog"
       "require" "define" "exports"))))
