emacs.org
** Python

    #+NAME: programming
    #+BEGIN_SRC emacs-lisp :tangle no
      (use-package python
        :config
        (progn
          (setq python-indent-guess-indent-offset nil)

          (defun td/setup-python ()
            (interactive)
            (anaconda-mode t)
            (eldoc-mode t)
            ;; (add-to-list 'company-backends 'company-anaconda)
            )

          (add-hook 'python-mode-hook #'td/setup-python)))
    #+END_SRC

** PHP

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (use-package php-mode
       :mode "\\.php\\'"
       :config
       (progn
         (setq php-template-compatibility nil
               php-manual-path "~/local/docs/php"
               php-mode-warn-if-mumamo-off nil
               php-mode-coding-style 'drupal)))
   #+end_src

** Web

   I used to be a happy ~mmm-mode~ user; I even added support for some
   interesting stuff. However ~mmm-mode~ needs some updates to work with
   Emacs 24.4, in the mean time I use ~web-mode~.

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (use-package web-mode
       :mode (("\\.phtml\\'" . web-mode)
              ("/\\(views\\|html\\|templates\\)/.*\\.php\\'" . web-mode)
              ("\\.tpl\\'" . web-mode)
              ("\\.[gj]sp\\'" . web-mode)
              ("\\.as[cp]x\\'" . web-mode)
              ("\\.erb\\'" . web-mode)
              ("\\.mustache\\'" . web-mode)
              ("\\.djhtml\\'" . web-mode)
              ("\\.jinja2\\'" . web-mode)
              ("\\.html?" . web-mode)
              ("\\.hbs\\'" . web-mode))
       :config
       (progn
         (setq web-mode-markup-indent-offset 2)
         (add-hook 'web-mode-hook #'turn-off-auto-fill)
         (add-to-list 'web-mode-imenu-regexp-list
                       '(" \\(ng-[a-z]*\\)=\"\\([a-zA-Z0-9]*\\)" 1 2 "="))))
   #+end_src


   I also use ~emmet-mode~, it's a life-saver.

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (use-package emmet-mode
       :commands emmet-mode
       :init
       (progn
         (add-hook 'sgml-mode-hook #'emmet-mode)
         (add-hook 'web-mode-hook #'emmet-mode)
         (add-hook 'css-mode-hook #'emmet-mode))
       :config
       (progn
         (setq emmet-indentation 2
               emmet-preview-default nil
               emmet-insert-flash-time 0.1)

         (defadvice emmet-preview
           (after td/emmet-preview-hide-tooltip activate)
           (overlay-put emmet-preview-output 'before-string nil))))
   #+end_src

** CSS/SASS/LESS

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (defun td/css-imenu-expressions ()
       (add-to-list 'imenu-generic-expression '("Section" "^.*\\* =\\(.+\\)$" 1) t))

     (use-package css-mode
       :mode "\\.css\\'"
       :init
       (progn
         (setq-default css-indent-offset 2)
         (add-hook 'css-mode-hook #'td/css-imenu-expressions)))

     (use-package scss-mode
       :mode "\\.scss\\'"
       :init
       (progn
         (setq scss-compile-at-save nil
               css-indent-offset 2)
         (add-hook 'scss-mode-hook #'td/css-imenu-expressions)))

     (use-package less-css-mode
       :mode "\\.less\\'"
       :init
       (progn
         ;; TODO: customize `less-css-indent-line' to support nested ruleset
         (add-hook 'less-css-mode-hook #'td/css-imenu-expressions)))
   #+end_src

** Markdown

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (use-package markdown-mode
       :mode (("\\.md$" . markdown-mode)
              ("\\.mkd$" . markdown-mode)
              ("\\.markdown$" . markdown-mode))
       :config
       (progn
         (setq markdown-command "redcarpet"
               markdown-enable-math t
               markdown-header-face '(:inherit font-lock-function-name-face :weight bold)
               markdown-header-face-1 '(:inherit markdown-header-face :height 2.0)
               markdown-header-face-2 '(:inherit markdown-header-face :height 1.6)
               markdown-header-face-3 '(:inherit markdown-header-face :height 1.4)
               markdown-header-face-4 '(:inherit markdown-header-face :height 1.2))

         (add-hook 'markdown-mode-hook #'turn-on-flyspell)
         (add-hook 'markdown-mode-hook #'turn-on-auto-fill)))
   #+end_src

** XML

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (use-package nxml-mode
       :defer t
       :config
       (progn
         (defun nxml-where ()
           "Display the hierarchy of XML elements the point is on as a path."
           (interactive)
           (let ((path nil))
             (save-excursion
               (save-restriction
                 (widen)
                 (while (and (< (point-min) (point)) ;; Doesn't error if point is at beginning of buffer
                             (condition-case nil
                                 (progn
                                   (nxml-backward-up-element) ; always returns nil
                                   t)
                               (error nil)))
                   (setq path (cons (xmltok-start-tag-local-name) path)))
                 (if (called-interactively-p t)
                     (message "/%s" (mapconcat 'identity path "/"))
                   (format "/%s" (mapconcat 'identity path "/")))))))

         (bind-key "C-c C-p" 'nxml-where)))
   #+end_src

** Fish

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (use-package fish-mode
       :mode (("\\.fish$" . fish-mode))
       :config
       (progn

         (defun td/setup-fish-mode ()
           (setq-local tab-width 2))

         (add-hook 'fish-mode-hook #'td/setup-fish-mode)))
   #+end_src

** Shell

   #+name: programming
   #+begin_src emacs-lisp :tangle no
     (use-package sh-script
       :defer t
       :init
       (setq-default sh-basic-offset 2))
   #+end_src

* Org

** Basic Settings

   #+NAME: org
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package org
       :config
       (progn
         (setq org-directory "~/Documents/"
               org-default-notes-file (expand-file-name "inbox.org" org-directory))

         (setq org-capture-templates
               '(("t" "To-do" entry
                  (file+headline "" "Inbox")
                  "* TODO %u %?"
                  :clock-keep t :kill-buffer t)
                 ("r" "Links to read" checkitem
                  (file+headline "" "Reading list")
                  "[ ] %?"
                  :clock-keep t :kill-buffer t)
                 ("l" "Download" checkitem
                  (file+headline "" "Download")
                  "[ ] %?"
                  :clock-keep t :kill-buffer t)))

         (setq org-goto-interface 'outline-path-completion
               org-log-done 'time
               org-log-into-drawer t
               org-refile-allow-creating-parent-nodes 'confirm
               org-refile-use-outline-path t
               org-return-follows-link t
               org-catch-invisible-edits 'show-and-error)

         (setq org-todo-keywords
               '((sequence "TODO(t)" "STARTED(s!)" "WAITING(w@/!)"
                           "|" "CANCELED(c@)" "DONE(d!)")))

         (setq org-src-fontify-natively t
               org-src-tab-acts-natively t)

         (setq org-hide-leading-stars t)))
   #+END_SRC

** Agenda

*** Basic Configuration

    #+NAME: org
    #+BEGIN_SRC emacs-lisp :tangle no
      (use-package org-agenda
        :commands (org-agenda org-agenda-list)
        :config
        (setq org-agenda-files
              '("~/Documents/inbox.org" "~/Documents/projects.org" "~/Documents/archives.org")
              org-agenda-skip-unavailable-files t
              org-agenda-skip-deadline-if-done nil
              org-agenda-skip-scheduled-if-done nil
              org-agenda-restore-windows-after-quit t
              org-agenda-window-setup 'current-window
              org-agenda-show-all-dates t
              org-agenda-show-log t))
    #+END_SRC

*** Custom Agenda Commands

    Below are our custom agenda commands:

    | Key | Description                                          |
    |-----+------------------------------------------------------|
    | =d=   | Timeline for today, and next actions from todo lists |
    | =w=   | Items with status WAITING                            |
    | =n=   | Next actions                                         |
    | =r=   | Weekly review                                        |

    #+NAME: org
    #+BEGIN_SRC emacs-lisp :tangle no
      (setq org-agenda-custom-commands
            '(("d" "Agenda + Next Actions" ((agenda) (todo "TODO")))
              ("w" todo "WAITING" nil)
              ("n" todo "TODO" nil)
              ("r" "Weekly Review"
               ((agenda "" ((org-agenda-ndays 7)))
                ;; type "l" in the agenda to review logged items
                (stuck "")
                (todo "PROJECT")
                (todo "MAYBE")
                (todo "WAITING")))))

    #+END_SRC

*** Automatically Show Agenda

    I tend not to consult the agenda often enough, so let's show it
    after Emacs is idle for a while.

    #+NAME: org
    #+BEGIN_SRC emacs-lisp :tangle no
      (defun td/jump-to-org-agenda ()
        (interactive)
        (let ((buf (get-buffer "*Org Agenda*"))
              wind)
          (if buf
              (if (setq wind (get-buffer-window buf))
                  (select-window wind)
                (if (called-interactively-p)
                    (progn
                      (select-window (display-buffer buf t t))
                      (org-fit-window-to-buffer))
                  (with-selected-window (display-buffer buf)
                    (org-fit-window-to-buffer))))
            (call-interactively 'org-agenda-list))))

      (run-with-idle-timer 2400 t 'td/jump-to-org-agenda)
    #+END_SRC

** Tags

   Org headlines can be tagged such that they are easier to find and
   filter. Here we set up reusable tags with mnemonic shortcuts.

   #+NAME: org
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq org-tag-alist '(("@work" . ?W)     ; Contexts
                           ("@home" . ?H)
                           ("@school" . ?S)
                           ("@errand" . ?E)
                           ("build" . ?b)     ; Task types
                           ("earn" . ?e)
                           ("learn" . ?l)
                           ("focus" . ?f)     ; Task statuses
                           ("someday" . ?s)
                           ("delegate" . ?d)))
   #+END_SRC

** Exporting

   #+NAME: org
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq org-hide-emphasis-markers t
           org-export-with-section-numbers nil
           org-export-backends '(html latex md))
   #+END_SRC

*** HTML

   Exporting options for HTML backend.

   #+NAME: org
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq org-html-preamble nil
           org-html-postamble nil
           org-html-head-include-default-style nil
           org-html-head-include-scripts nil
           org-html-head
           (concat "<link rel=\"stylesheet\" type=\"text/css\" href=\"org.css\" />\n"
                   "<meta name=\"viewport\" content=\"initial-scale=1,maximum-scale=1\" />")
           org-html-text-markup-alist
           '((bold . "<strong>%s</strong>")
             (code . "<code>%s</code>")
             (italic . "<em>%s</em>")
             (strike-through . "<del>%s</del>")
             (underline . "<dfn>%s</dfn>") ; Somewhat arbitrary
             (verbatim . "<kbd>%s</kbd>")))
   #+END_SRC

*** Latex

    Exporting options for Latex backend.
    - Hightlight code blocks.

    #+BEGIN_SRC emacs-lisp :tangle no
      (setq  org-export-latex-listings 'minted)
    #+END_SRC

