emacs.el
(use-package python
  :config
  (progn
    (setq python-indent-guess-indent-offset nil)

    (defun td/setup-python ()
      (interactive)
      (anaconda-mode t)
      (eldoc-mode t)
      ;; (add-to-list 'company-backends 'company-anaconda)
      )

    (add-hook 'python-mode-hook #'td/setup-python)))
(use-package php-mode
  :mode "\\.php\\'"
  :config
  (progn
    (setq php-template-compatibility nil
          php-manual-path "~/local/docs/php"
          php-mode-warn-if-mumamo-off nil
          php-mode-coding-style 'drupal)))
(use-package web-mode
  :mode (("\\.phtml\\'" . web-mode)
         ("/\\(views\\|html\\|templates\\)/.*\\.php\\'" . web-mode)
         ("\\.tpl\\'" . web-mode)
         ("\\.[gj]sp\\'" . web-mode)
         ("\\.as[cp]x\\'" . web-mode)
         ("\\.erb\\'" . web-mode)
         ("\\.mustache\\'" . web-mode)
         ("\\.djhtml\\'" . web-mode)
         ("\\.jinja2\\'" . web-mode)
         ("\\.html?" . web-mode)
         ("\\.hbs\\'" . web-mode))
  :config
  (progn
    (setq web-mode-markup-indent-offset 2)
    (add-hook 'web-mode-hook #'turn-off-auto-fill)
    (add-to-list 'web-mode-imenu-regexp-list
                  '(" \\(ng-[a-z]*\\)=\"\\([a-zA-Z0-9]*\\)" 1 2 "="))))
(use-package emmet-mode
  :commands emmet-mode
  :init
  (progn
    (add-hook 'sgml-mode-hook #'emmet-mode)
    (add-hook 'web-mode-hook #'emmet-mode)
    (add-hook 'css-mode-hook #'emmet-mode))
  :config
  (progn
    (setq emmet-indentation 2
          emmet-preview-default nil
          emmet-insert-flash-time 0.1)

    (defadvice emmet-preview
      (after td/emmet-preview-hide-tooltip activate)
      (overlay-put emmet-preview-output 'before-string nil))))
(defun td/css-imenu-expressions ()
  (add-to-list 'imenu-generic-expression '("Section" "^.*\\* =\\(.+\\)$" 1) t))

(use-package css-mode
  :mode "\\.css\\'"
  :init
  (progn
    (setq-default css-indent-offset 2)
    (add-hook 'css-mode-hook #'td/css-imenu-expressions)))

(use-package scss-mode
  :mode "\\.scss\\'"
  :init
  (progn
    (setq scss-compile-at-save nil
          css-indent-offset 2)
    (add-hook 'scss-mode-hook #'td/css-imenu-expressions)))

(use-package less-css-mode
  :mode "\\.less\\'"
  :init
  (progn
    ;; TODO: customize `less-css-indent-line' to support nested ruleset
    (add-hook 'less-css-mode-hook #'td/css-imenu-expressions)))
(use-package markdown-mode
  :mode (("\\.md$" . markdown-mode)
         ("\\.mkd$" . markdown-mode)
         ("\\.markdown$" . markdown-mode))
  :config
  (progn
    (setq markdown-command "redcarpet"
          markdown-enable-math t
          markdown-header-face '(:inherit font-lock-function-name-face :weight bold)
          markdown-header-face-1 '(:inherit markdown-header-face :height 2.0)
          markdown-header-face-2 '(:inherit markdown-header-face :height 1.6)
          markdown-header-face-3 '(:inherit markdown-header-face :height 1.4)
          markdown-header-face-4 '(:inherit markdown-header-face :height 1.2))

    (add-hook 'markdown-mode-hook #'turn-on-flyspell)
    (add-hook 'markdown-mode-hook #'turn-on-auto-fill)))
(use-package nxml-mode
  :defer t
  :config
  (progn
    (defun nxml-where ()
      "Display the hierarchy of XML elements the point is on as a path."
      (interactive)
      (let ((path nil))
        (save-excursion
          (save-restriction
            (widen)
            (while (and (< (point-min) (point)) ;; Doesn't error if point is at beginning of buffer
                        (condition-case nil
                            (progn
                              (nxml-backward-up-element) ; always returns nil
                              t)
                          (error nil)))
              (setq path (cons (xmltok-start-tag-local-name) path)))
            (if (called-interactively-p t)
                (message "/%s" (mapconcat 'identity path "/"))
              (format "/%s" (mapconcat 'identity path "/")))))))

    (bind-key "C-c C-p" 'nxml-where)))
(use-package fish-mode
  :mode (("\\.fish$" . fish-mode))
  :config
  (progn

    (defun td/setup-fish-mode ()
      (setq-local tab-width 2))

    (add-hook 'fish-mode-hook #'td/setup-fish-mode)))
(use-package sh-script
  :defer t
  :init
  (setq-default sh-basic-offset 2))

;; Configuration group: management
