emacs.org
** Templates

   Org mode provides a mechanism for inserting [[http://orgmode.org/manual/Easy-Templates.html][templates]] into Org
   documents. To insert a structural element, type a =<=, followed by a
   template selector and =<TAB>=.

** Babel

   =org-babel= allows me to embed and evaluate code inside org files. It is
   quite useful but also impose some security risks, so I only enables a
   handful number of languages.

   #+NAME: org
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package ob-core
       :defer t
       :config
       (progn
         (org-babel-do-load-languages
          'org-babel-load-languages
          '((calc . t)
            (http . t)
            (python . t)
            (sql . t)
            (sqlite . t)
            (elasticsearch . t)))

         (defun td/org-babel-whitelist (lang body)
           (not (or (string= lang "http")
                    (string= lang "es"))))

         (setq org-confirm-babel-evaluate #'td/org-babel-whitelist)))
   #+END_SRC

** Key Bindings

*** Hierarchy

    | Binding        | Function                                     |
    |----------------+----------------------------------------------|
    | =M-<left/right>= | Promote/demote current headline or list item |
    | =M-<enter>=      | Create new item at current level             |
    | =M-S-<enter>=    | Create new TODO at current level             |

*** To-Dos

    | Binding     | Function                                       |
    |-------------+------------------------------------------------|
    | =C-c C-t=     | Cycle state                                    |
    | =C-c C-s=     | Schedule it                                    |
    | =C-c C-d=     | Set deadline                                   |
    | =C-c <comma>= | Set priority                                   |
    | =S-<up/down>= | Increase/decrease priority of current headline |
    | =C-c C-c=     | Toggle checkbox state                          |
    | =C-u C-c C-c= | Toggle checkbox presence                       |

*** Links

    | Binding | Function                    |
    |---------+-----------------------------|
    | =C-c C-l= | Insert link or edit current |

*** Dates and Times

    | Binding               | Function                                              |
    |-----------------------+-------------------------------------------------------|
    | =C-c .=                 | Insert timestamp (use twice to insert range)          |
    | =C-c !=                 | Insert inactive timestamp (doesn't appear in agendas) |
    | =C-u C-c .= / =C-u C-c != | Like above but including time                         |
    | =S-<left/right>=        | Increment/decrement by day                            |
    | =S-<up/down>=           | Increment/decrement segment at cursor                 |
    | =C-c C-y=               | Evaluate time range and insert after range text       |

*** Tags

    | Binding | Function       |
    |---------+----------------|
    | =C-c C-q= | Tag a headline |

*** Archiving

    | Binding         | Function                                                |
    |-----------------+---------------------------------------------------------|
    | =C-c C-x C-a=     | Archive current item                                    |
    | =C-u C-c C-x C-s= | Prompt to archive each non-TODO subtree of current item |

*** Source Code

    | Binding            | Function                              |
    |--------------------+---------------------------------------|
    | =C-c <single-quote>= | Edit current ~SRC~ block in native mode |

*** Customization

   #+NAME: org
   #+BEGIN_SRC emacs-lisp :tangle no
     (bind-key "C-c o a" #'org-agenda)
     (bind-key "C-c o c" #'org-capture)
     (bind-key "C-c o l" #'org-store-link)
   #+END_SRC

* Management

** Deft

   I use =Deft= to manage my =org-mode= files.

   #+NAME: management
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package deft
       :bind ("C-c b d" . deft)
       :config
       (progn
         (setq deft-extension "org"
               deft-text-mode 'org-mode
               deft-directory "~/Documents"
               deft-strip-title-regexp "\\(?:^%+\\|#\\+[[:alpha:]]+:\\|^[#* ]+\\|-\\*-[[:alpha:]]+-\\*-\\|#+$\\)")))
   #+END_SRC

** Shell

   #+name: management
   #+begin_src emacs-lisp :tangle no
     (use-package eshell
       :defer t
       :init
       (progn
         (setq eshell-list-files-after-cd t)

         (defun td/find-eshell ()
           (interactive)
           (if (get-buffer "*eshell*")
               (switch-to-buffer-other-window "*eshell*")
             (split-window-sensibly (selected-window))
             (other-window 1)
             (eshell)))

         (defun td/find-eshell-default-directory ()
           (interactive)
           (let ((cwd default-directory))
             (td/find-eshell)
             (eshell/cd cwd)))

         (bind-keys :map td/custom-map
                    ("t" . td/find-eshell)
                    ("s" . td/find-eshell-default-directory))
         :config
         (progn
           (defmacro td/with-face (str &rest properties)
             `(propertize ,str 'face (list ,@properties)))

           (defun td/eshell-pwd ()
             (replace-regexp-in-string
              (regexp-quote (expand-file-name "~"))
              "~"
              (eshell/pwd)))

           (defun td/eshell-prompt ()
             (format
              "\n%s@%s in %s\n%s "
              (td/with-face user-login-name :foreground "#dc322f")
              (td/with-face (or (getenv "HOST") system-name) :foreground "#b58900")
              (td/with-face (td/eshell-pwd) :foreground "#859900")
              (if (= (user-uid) 0) (with-face "#" :foreground "red") "$")))

           (defalias 'eshell/e 'find-file-other-window)

           (defun eshell/open (args)
             (interactive)
             (shell-command
              (concat (case system-type
                        ((darwin) "open")
                        ((windows-nt) "start")
                        (t "xdg-open"))
                      (format " %s" args))))

           (setq eshell-prompt-function #'td/eshell-prompt
                 eshell-prompt-regexp "^[^#$\\n]*[#$] "
                 eshell-highlight-prompt nil))))
   #+end_src

** TRAMP

   #+name: management
   #+begin_src emacs-lisp :tangle no
     (use-package tramp
       :defer t
       :config
       (progn
         (setq password-cache-expiry nil
               tramp-debug-buffer t
               tramp-default-method "ftp")

         (add-to-list 'auth-sources "~/.emacs.d/authinfo.gpg")
         (setq ange-ftp-netrc-filename "~/.emacs.d/authinfo.gpg")))
   #+end_src

** Dired

   #+name: management
   #+begin_src emacs-lisp :tangle no
     (use-package dired
       :defer t
       :config
       (progn
         (setq dired-listing-switches "-alh"
               dired-recursive-copies 'always
               dired-recursive-deletes 'always)

         (defun td/dired-back-to-top ()
           (interactive)
           (goto-char (point-min))
           (dired-next-line 4))

         (defun td/dired-jump-to-bottom ()
           (interactive)
           (goto-char (point-max))
           (dired-next-line -1))

         (bind-keys :map dired-mode-map
                    ("M-<" . td/dired-back-to-top)
                    ("M->" . td/dired-jump-to-bottom))))
   #+end_src

** Recent files

   #+name: management
   #+begin_src emacs-lisp :tangle no
     (use-package recentf
       :defer 1
       :config
       (progn
         (setq recentf-auto-cleanup "9:00pm"
               recentf-max-saved-items 256)

         (add-hook 'server-visit-hook #'recentf-save-list)

         (add-to-list 'recentf-exclude "elpa")

         (defun recentf-ido-find-file ()
           "Find a recent file using Ido."
           (interactive)
           (let ((file (ido-completing-read "Recent file: " recentf-list nil t)))
             (when file
               (find-file file))))

         (bind-key "C-c ;" #'recentf-ido-find-file)

         (recentf-mode t)))
   #+end_src

** EMMS

   #+name: management
   #+begin_src emacs-lisp :tangle no
     (use-package emms
       :defer t
       :config
       (progn
         (require 'emms-setup)

         (emms-standard)
         (emms-default-players)

         (setq emms-source-file-default-directory "~/Music/"
               emms-info-asynchronously t
               emms-show-format "♫ %s"
               emms-repeat-playlist t)

         (require 'emms-mode-line)
         (require 'emms-mode-line-icon)
         (setq emms-mode-line-format " [%s] ")
         (emms-mode-line 1)

         (define-emms-simple-player afplay '(file)
           (regexp-opt '(".mp3" ".m4a" ".aac"))
           "afplay")
         (setq emms-player-list `(,emms-player-afplay))))

     (use-package emms-browser
       :bind (("<f7>" . emms-smart-browse))
       :config
       (setq emms-browser-covers
             '("cover_small.jpg" "cover_medium.jpg" "cover.jpg")))
   #+end_src

** Evernote

   #+NAME: management
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package epic
       :commands (epic-create-note-from-region
       epic-insert-selected-note-as-org-links
       epic-create-note-from-org-buffer)
       :config
       (setq epic-evernote-mail-address "tungd.5740caa@m.evernote.com"))
   #+END_SRC

