emacs.el
(use-package deft
  :bind ("C-c b d" . deft)
  :config
  (progn
    (setq deft-extension "org"
          deft-text-mode 'org-mode
          deft-directory "~/Documents"
          deft-strip-title-regexp "\\(?:^%+\\|#\\+[[:alpha:]]+:\\|^[#* ]+\\|-\\*-[[:alpha:]]+-\\*-\\|#+$\\)")))
(use-package eshell
  :defer t
  :init
  (progn
    (setq eshell-list-files-after-cd t)

    (defun td/find-eshell ()
      (interactive)
      (if (get-buffer "*eshell*")
          (switch-to-buffer-other-window "*eshell*")
        (split-window-sensibly (selected-window))
        (other-window 1)
        (eshell)))

    (defun td/find-eshell-default-directory ()
      (interactive)
      (let ((cwd default-directory))
        (td/find-eshell)
        (eshell/cd cwd)))

    (bind-keys :map td/custom-map
               ("t" . td/find-eshell)
               ("s" . td/find-eshell-default-directory))
    :config
    (progn
      (defmacro td/with-face (str &rest properties)
        `(propertize ,str 'face (list ,@properties)))

      (defun td/eshell-pwd ()
        (replace-regexp-in-string
         (regexp-quote (expand-file-name "~"))
         "~"
         (eshell/pwd)))

      (defun td/eshell-prompt ()
        (format
         "\n%s@%s in %s\n%s "
         (td/with-face user-login-name :foreground "#dc322f")
         (td/with-face (or (getenv "HOST") system-name) :foreground "#b58900")
         (td/with-face (td/eshell-pwd) :foreground "#859900")
         (if (= (user-uid) 0) (with-face "#" :foreground "red") "$")))

      (defalias 'eshell/e 'find-file-other-window)

      (defun eshell/open (args)
        (interactive)
        (shell-command
         (concat (case system-type
                   ((darwin) "open")
                   ((windows-nt) "start")
                   (t "xdg-open"))
                 (format " %s" args))))

      (setq eshell-prompt-function #'td/eshell-prompt
            eshell-prompt-regexp "^[^#$\\n]*[#$] "
            eshell-highlight-prompt nil))))
(use-package tramp
  :defer t
  :config
  (progn
    (setq password-cache-expiry nil
          tramp-debug-buffer t
          tramp-default-method "ftp")

    (add-to-list 'auth-sources "~/.emacs.d/authinfo.gpg")
    (setq ange-ftp-netrc-filename "~/.emacs.d/authinfo.gpg")))
(use-package dired
  :defer t
  :config
  (progn
    (setq dired-listing-switches "-alh"
          dired-recursive-copies 'always
          dired-recursive-deletes 'always)

    (defun td/dired-back-to-top ()
      (interactive)
      (goto-char (point-min))
      (dired-next-line 4))

    (defun td/dired-jump-to-bottom ()
      (interactive)
      (goto-char (point-max))
      (dired-next-line -1))

    (bind-keys :map dired-mode-map
               ("M-<" . td/dired-back-to-top)
               ("M->" . td/dired-jump-to-bottom))))
(use-package recentf
  :defer 1
  :config
  (progn
    (setq recentf-auto-cleanup "9:00pm"
          recentf-max-saved-items 256)

    (add-hook 'server-visit-hook #'recentf-save-list)

    (add-to-list 'recentf-exclude "elpa")

    (defun recentf-ido-find-file ()
      "Find a recent file using Ido."
      (interactive)
      (let ((file (ido-completing-read "Recent file: " recentf-list nil t)))
        (when file
          (find-file file))))

    (bind-key "C-c ;" #'recentf-ido-find-file)

    (recentf-mode t)))
(use-package emms
  :defer t
  :config
  (progn
    (require 'emms-setup)

    (emms-standard)
    (emms-default-players)

    (setq emms-source-file-default-directory "~/Music/"
          emms-info-asynchronously t
          emms-show-format "♫ %s"
          emms-repeat-playlist t)

    (require 'emms-mode-line)
    (require 'emms-mode-line-icon)
    (setq emms-mode-line-format " [%s] ")
    (emms-mode-line 1)

    (define-emms-simple-player afplay '(file)
      (regexp-opt '(".mp3" ".m4a" ".aac"))
      "afplay")
    (setq emms-player-list `(,emms-player-afplay))))

(use-package emms-browser
  :bind (("<f7>" . emms-smart-browse))
  :config
  (setq emms-browser-covers
        '("cover_small.jpg" "cover_medium.jpg" "cover.jpg")))
(use-package epic
  :commands (epic-create-note-from-region
  epic-insert-selected-note-as-org-links
  epic-create-note-from-org-buffer)
  :config
  (setq epic-evernote-mail-address "tungd.5740caa@m.evernote.com"))
